Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 572, 572, 12 0                                            
__________________________________________________________________________________________________
conv1_1 (Conv2D)                (None, 572, 572, 32) 3488        input_1[0][0]                    
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 572, 572, 32) 9248        conv1_1[0][0]                    
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 286, 286, 32) 0           conv2d[0][0]                     
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 286, 286, 64) 18496       max_pooling2d[0][0]              
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 286, 286, 64) 36928       conv2d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 143, 143, 64) 0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 143, 143, 128 73856       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 143, 143, 128 147584      conv2d_3[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 71, 71, 128)  0           conv2d_4[0][0]                   
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 71, 71, 256)  295168      max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 71, 71, 256)  590080      conv2d_5[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 35, 35, 256)  0           conv2d_6[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 35, 35, 512)  1180160     max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 35, 35, 512)  2359808     conv2d_7[0][0]                   
__________________________________________________________________________________________________
up_sampling2d (UpSampling2D)    (None, 70, 70, 512)  0           conv2d_8[0][0]                   
__________________________________________________________________________________________________
cropping2d (Cropping2D)         (None, 70, 70, 256)  0           conv2d_6[0][0]                   
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 70, 70, 768)  0           up_sampling2d[0][0]              
                                                                 cropping2d[0][0]                 
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 70, 70, 256)  1769728     concatenate[0][0]                
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 70, 70, 256)  590080      conv2d_9[0][0]                   
__________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)  (None, 140, 140, 256 0           conv2d_10[0][0]                  
__________________________________________________________________________________________________
cropping2d_1 (Cropping2D)       (None, 140, 140, 128 0           conv2d_4[0][0]                   
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 140, 140, 384 0           up_sampling2d_1[0][0]            
                                                                 cropping2d_1[0][0]               
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 140, 140, 128 442496      concatenate_1[0][0]              
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 140, 140, 128 147584      conv2d_11[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_2 (UpSampling2D)  (None, 280, 280, 128 0           conv2d_12[0][0]                  
__________________________________________________________________________________________________
cropping2d_2 (Cropping2D)       (None, 280, 280, 64) 0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 280, 280, 192 0           up_sampling2d_2[0][0]            
                                                                 cropping2d_2[0][0]               
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 280, 280, 64) 110656      concatenate_2[0][0]              
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 280, 280, 64) 36928       conv2d_13[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_3 (UpSampling2D)  (None, 560, 560, 64) 0           conv2d_14[0][0]                  
__________________________________________________________________________________________________
cropping2d_3 (Cropping2D)       (None, 560, 560, 32) 0           conv2d[0][0]                     
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 560, 560, 96) 0           up_sampling2d_3[0][0]            
                                                                 cropping2d_3[0][0]               
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 560, 560, 32) 27680       concatenate_3[0][0]              
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 560, 560, 32) 9248        conv2d_15[0][0]                  
__________________________________________________________________________________________________
zero_padding2d (ZeroPadding2D)  (None, 572, 572, 32) 0           conv2d_16[0][0]                  
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 572, 572, 2)  66          zero_padding2d[0][0]             
==================================================================================================
Total params: 7,849,282
Trainable params: 7,849,282
Non-trainable params: 0
